{
  "projects": {
    "STG": {
      "title": "STG لوحة تحكم",
      "description": {
        "main": "يعد تطبيق الويب للوحة المعلومات حلاً قويًا وغنيًا بالميزات لإدارة تطبيق STG Android. فهو يوفر للمستخدمين منصة جذابة لممارسة الألعاب والفوز بالجوائز، مع توفير واجهة مستخدم بديهية وأداء محسّن وتجربة مستخدم سلسة. مدعومًا بـ React.js وJavaScript وTypeScript، يتميز التطبيق بمجموعة رائعة من الميزات.",
        "list": {
          "i18n": "ويدعم التطبيق أيضًا وظائف متعددة اللغات مع i18next، مما يتيح للمستخدمين التبديل بسلاسة بين الإنجليزية والعربية والألمانية.",
          "casl": "تتم إدارة أذونات المستخدم بدقة باستخدام مكتبة CASL، مما يسمح بالتحكم الدقيق في الوصول بناءً على أذونات المستخدم."
        }
      },
      "owner": "STG"
    },
    "realEstate": {
      "title": "تطبيق العقارات الإلكتروني",
      "description": {
        "main": "ادخل إلى عالم العقارات باستخدام تطبيق الويب الاستثنائي هذا. استكشف مجموعة واسعة من العقارات المتاحة للبيع أو الإيجار، وأضفها بسهولة إلى المفضلة لديك. علاوة على ذلك، يتمتع المستخدمون بسهولة إدراج عقاراتهم للبيع أو الإيجار. بفضل واجهة المستخدم البديهية والأداء الأمثل وتجربة المستخدم السلسة، يضع هذا التطبيق معيارًا جديدًا في تصفح العقارات. مدعومًا بـ React.js وJavaScript وTypeScript، فهو يقدم مجموعة رائعة من الميزات التي ستأسر اهتمام كل مستخدم.",
        "list": {
          "i18n": "ويدعم التطبيق أيضًا وظائف متعددة اللغات مع i18next، مما يتيح للمستخدمين التبديل بسهولة بين اللغتين الإنجليزية والعربية.",
          "formik": "قم ببناء نموذج متعدد الخطوات تتم إدارته باستخدام Formik وYup، مما يضمن سلامة البيانات ودقتها.",
          "pagination": "يتضمن التطبيق ميزات متقدمة مثل ترقيم الصفحات عند التمرير، مما يضمن استرجاع البيانات بكفاءة عن طريق جلب أجزاء أصغر من البيانات في المرة الواحدة."
        }
      },
      "owner": "يحى درويش"
    },
    "addressDashboard": {
      "title": "address لوحة تحكم",
      "description": {
        "main": "نقدم لكم لوحة التحكم المصممة لتبسيط إدارة تطبيق Address Android. تقدم Address، وهي منصة تجارة إلكترونية شاملة، مجموعة واسعة من المنتجات التي تغطي فئات متنوعة بما في ذلك المحلات التجارية والمطاعم والصيدليات والأطباء والخدمات الحكومية وغيرها. باستخدام هذا التطبيق، يمكن للمستخدمين استكشاف المنتجات وشرائها بسهولة من شبكة واسعة من تجار التجزئة. من خلال المزج بسلاسة بين واجهة المستخدم البديهية والأداء الأمثل، تضع لوحة المعلومات هذه معيارًا جديدًا للكفاءة. مدعومًا بالتقنيات المتطورة لـ Next.js وReact.js وJavaScript، يعرض هذا التطبيق مجموعة رائعة من الميزات.",
        "list": {
          "ui": "تم تصميم واجهة المستخدم باستخدام مكتبات مجموعة Tailwind وReact، مما يضمن تصميمًا سريع الاستجابة وأنيقًا وجذابًا.",
          "casl": "تتم إدارة أذونات المستخدم بدقة باستخدام مكتبة CASL، مما يسمح بالتحكم الدقيق في الوصول استنادًا إلى أدوار المستخدم وأذوناته."
        }
      },
      "owner": "Levant شركة"
    },
    "addressApp": {
      "title": "Address تطبيق",
      "description": {
        "main": " تقدم Address، وهي منصة تجارة إلكترونية شاملة، مجموعة واسعة من المنتجات التي تغطي فئات متنوعة بما في ذلك المحلات التجارية والمطاعم والصيدليات والأطباء والخدمات الحكومية وغيرها. باستخدام هذا التطبيق، يمكن للمستخدمين استكشاف المنتجات وشرائها بسهولة من شبكة واسعة من تجار التجزئة. يمزج هذا التطبيق بسلاسة بين واجهة المستخدم البديهية والأداء الأمثل، ويضع معيارًا جديدًا للكفاءة. مدعومًا بالتقنيات المتطورة لـ Next.js وReact.js وJavaScript، يعرض هذا التطبيق مجموعة رائعة من الميزات.",
        "list": {
          "i18n": "The app further supports multilingual functionality with i18next, enabling users to seamlessly switch between English and Arabic ."
        }
      },
      "owner": "Levant شركة"
    },
    "humyDashboard": {
      "title": "humy لوحة تحكم",
      "description": {
        "main": "نقدم لك لوحة تحكم ديناميكية تم تصميمها بدقة لتبسيط إدارة تطبيقات Android المتواضعة. يُحدث Humy ثورة في مشهد الطهي من خلال تمكين الطهاة المنزليين من إنشاء وبيع إبداعاتهم اللذيذة، وتسليمها مباشرة إلى عتبة باب العملاء. يتألف هذا النظام البيئي الشامل من ثلاثة تطبيقات متميزة للمستخدمين وموظفي التوصيل والرواد، ويضمن تجربة سلسة لجميع أصحاب المصلحة. من خلال المزج بسلاسة بين واجهة المستخدم البديهية والأداء الأمثل، تضع لوحة المعلومات هذه معيارًا جديدًا للكفاءة في ريادة الأعمال في مجال الطهي. مدعومًا بالتقنيات المتطورة لـ React.js وJavaScript وTypescript، يعرض هذا التطبيق مجموعة رائعة من الميزات، مما يتيح سوقًا مزدهرًا لمأكولات الطهي المنزلية.",
        "list": {
          "i18n": "ويدعم التطبيق أيضًا وظائف متعددة اللغات مع i18next، مما يتيح للمستخدمين التبديل بسلاسة بين الإنجليزية والعربية والتركية.",
          "permission": "تتم إدارة أذونات المستخدم بدقة باستخدام context React.js، مما يسمح بالتحكم الدقيق في الوصول استنادًا إلى أدوار المستخدم وأذوناته."
        }
      },
      "owner": "UluTech شركة"
    },
    "humyLandingPage": {
      "title": "humy landing page",
      "description": {
        "main": "نقدم لكم صفحة landing page تعرض تطبيقات Android الرائعة. يُحدث Humy ثورة في مشهد الطهي من خلال تمكين الطهاة المنزليين الموهوبين من إطلاق العنان لإبداعاتهم اللذيذة، وإسعاد العملاء من خلال خدمة التوصيل المريحة إلى باب المنزل. يشتمل هذا النظام البيئي المبتكر على ثلاثة تطبيقات متميزة مصممة خصيصًا للمستخدمين وموظفي التوصيل والرواد، مما يضمن تجربة سلسة لجميع أصحاب المصلحة. مدعومًا بالتقنيات المتطورة لـ React.js وJavaScript وTypeScript، يكشف هذا التطبيق عن مجموعة مذهلة من الميزات.",
        "list": {
          "i18n": "ويدعم التطبيق أيضًا وظائف متعددة اللغات مع i18next، مما يتيح للمستخدمين التبديل بسلاسة بين الإنجليزية والعربية والتركية."
        }
      },
      "owner": "UluTech شركة"
    },
    "tripper": {
      "title": "Tripper",
      "description": {
        "main": "نقدم لكم تطبيق Tripper، وهو تطبيق سياحي غامر مصمم لتوجيه المسافرين عبر المناظر الطبيعية الساحرة في سوريا، والكشف عن جمالها الآسر وتسهيل الجولات السياحية المنظمة بدقة. يمكّن Tripper المستخدمين من التفاعل مع الوجهات الرائعة، وإضافتها بسهولة إلى مفضلاتهم ومشاركة التعليقات الثاقبة. تم تطويره باستخدام أدوات متطورة مثل React.js وJavaScript وTypeScript وMUI (Material-UI)، مما يوفر تجربة مستخدم سلسة ومذهلة بصريًا. انطلق في رحلات لا تُنسى مع Tripper واكتشف عجائب سوريا كما لم يحدث من قبل.",
        "list": {}
      },
      "owner": "مشروع شخصي"
    },
    "alLabeeb": {
      "title": "اللبيب",
      "description": {
        "main": "هذا النموذج الأولي للتطبيق، الذي تم تطويره لصالح شركة اللبيب، يربط الأفراد الصم بعالم السمع. فهو يحول اللغة المنطوقة إلى لغة الإشارة والعكس، مما يمكّن الأشخاص الصم من فهم التواصل المنطوق. بالإضافة إلى ذلك، فهو يترجم إيماءات لغة الإشارة إلى نص، مما يسهل التواصل بين الأفراد الصم والسامعين. يعزز التطبيق الشمولية، ويمكّن الأفراد الصم، ويكسر حواجز الاتصال باستخدام التكنولوجيا المتقدمة",
        "list": {
          "mediaType": "يتيح التطبيق للمستخدمين العمل مع أنواع الوسائط المختلفة، بما في ذلك تحميل ملفات الصور وتسجيل الصوت والتقاط لقطات الشاشة باستخدام كاميرا الجهاز."
        }
      },
      "owner": "اللبيب"
    },

    "smartNavigation": {
      "title": "التصفح الذكي",
      "description": {
        "main": "تقديم تطبيق ويب يعرض التنقل الذي يتم التحكم فيه بالصوت. بفضل قوة الذكاء الاصطناعي لتحويل الكلام إلى نص، يمكن للمستخدمين تصفح صفحات الويب بسهولة باستخدام الأوامر الصوتية الخاصة بهم. يعمل هذا التطبيق، المدعوم بواسطة React.js والمصمم باستخدام MUI (Material-UI)، على تحويل الكلمات المنطوقة بسلاسة إلى إجراءات بديهية، مما يوفر تجربة تصفح غامرة بدون استخدام اليدين. يرجى ملاحظة أن هذا التطبيق بمثابة عرض توضيحي يسلط الضوء على الإمكانيات المثيرة للتنقل الذكي عبر الويب.",
        "list": {}
      },
      "owner": "مشروع شخصي"
    }
  },
  "project": {
    "owner": "المالك : {{name}}",
    "estimatingTime": "تقدير الوقت للمشروع هو {{time}} ساعة. "
  },
  "commonDescription": {
    "MUI": "تم إنشاء واجهة المستخدم باستخدام مكتبة Material-UI (MUI)، مما يضمن تصميمًا سريع الاستجابة وأنيقًا وجذابًا.",
    "tailwind": "تم إنشاء واجهة المستخدم باستخدام مكتبة Tailwind CSS، مما يضمن تصميمًا سريع الاستجابة وأنيقًا وجذابًا.",
    "formik": "تتم إدارة معالجة النماذج والتحقق من صحتها بسلاسة باستخدام Formik وYup، مما يضمن سلامة البيانات ودقتها.",
    "reactHookForm": "تتم إدارة معالجة النماذج والتحقق من صحتها بسلاسة باستخدام react hook form and yup، مما يضمن سلامة البيانات ودقتها.",
    "reactQuery": "لتحسين جلب البيانات ومزامنتها مع الخادم، يستخدم التطبيق React Query، مما يوفر تخزينًا مؤقتًا فعالاً ويقلل طلبات الشبكة غير الضرورية.",
    "redux": "تمكين المشروع باستخدام Redux Toolkit، وهو مصدر واحد للحقيقة، ومواءمة تدفق البيانات وتنسيق تطبيق منظم بدقة. ومن خلال تسخير قوة Thunk، يصبح جلب واجهة برمجة التطبيقات (API) سلسًا، مما يفتح مجالًا لاسترجاع البيانات وإدارتها بكفاءة.",
    "axios": "يتم تعزيز قدرات الشبكات باستخدام Axios، وهي مكتبة عملاء HTTP شائعة، والتي تعمل على تبسيط استدعاءات واجهة برمجة التطبيقات (API).",
    "pagination": "يتضمن التطبيق ميزات متقدمة مثل ترقيم الصفحات، مما يضمن استرجاع البيانات بكفاءة عن طريق جلب أجزاء أصغر من البيانات في المرة الواحدة.",
    "debounce": "تعمل آلية البحث المرتد على تحسين وظيفة البحث عن طريق تأخير الطلبات بذكاء حتى يتوقف المستخدم عن الكتابة.",
    "persistFilterValues": "تخزين قيم البحث في رابط ال url للمشروع",
    "skeleton": "يستخدم التطبيق التحميل الهيكلي لتحسين تجربة المستخدم، وتوفير محتوى نائب أثناء جلب البيانات.",
    "toast": "تعمل إشعارات  على توصيل رسائل النجاح والفشل إلى المستخدمين بشكل أنيق.",
    "login": "تضمن صفحة تسجيل الدخول الآمنة الوصول الموثق إلى التطبيق.",
    "auth": "تضمن صفحات تسجيل الدخول والاشتراك الآمنة الوصول الموثق إلى التطبيق.",
    "guest": "انطلق في رحلة ممتعة، وامنح الوصول السلس إلى التطبيق كضيف محترم.",
    "charts": "يتم دمج المرئيات والمخططات بسلاسة في لوحة المعلومات، مما يوفر البيانات بطريقة واضحة وغنية بالمعلومات."
  }
}
